# Analysis of Retail Sales

## 1.0 Load the required modules
We start off by loading the ipython-sql extension and the python libraries that will enable us run queries on this notebook.

In [1]:
# load ipython extension
%load_ext sql

In [2]:
from decouple import config
import pandas as pd

## 2.0 Connect to Database

In [3]:
# parameters to connect to the sql database
host = config('HOST')
database = config('SQL_DATABASE')
user = config('SQL_USER')
password = config('SQL_PASSWORD')

In [4]:
# string to connect to the database
connection_string = f"postgresql://{user}:{password}@{host}/{database}"

In [5]:
# connect to the database
%sql $connection_string

## 3.0 Queries

## 3.1.0 Tables in the Database

In [6]:
# query the database and read the store_cities table
store_cities = %sql SELECT * FROM store_cities
# put the result from the query in a dataframe
store_cities_df = store_cities.DataFrame()
store_cities_df.info()

 * postgresql://postgres:***@localhost/sales
144 rows affected.
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   store_id      144 non-null    object
 1   storetype_id  144 non-null    object
 2   store_size    144 non-null    float64
 3   city_id       144 non-null    object
dtypes: float64(1), object(3)
memory usage: 4.6+ KB

In [7]:
# query the database and read the product table
product = %sql SELECT * FROM product
product_df = product.DataFrame()
product_df.info()

 * postgresql://postgres:***@localhost/sales
699 rows affected.
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 699 entries, 0 to 698
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_id      699 non-null    object
 1   product_length  681 non-null    float64
 2   product_depth   683 non-null    float64
 3   product_width   683 non-null    float64
 4   cluster_id      649 non-null    object
 5   hierarchy1_id   699 non-null    object
 6   hierarchy2_id   699 non-null    object
 7   hierarchy3_id   699 non-null    object
 8   hierarchy4_id   699 non-null    object
 9   hierarchy5_id   699 non-null    object
dtypes: float64(3), object(7)
memory usage: 54.7+ KB

The sales table contains millions of rows. It takes time to query the table and load the output into a dataframe. This makes it neccessary to load the dataframe in a pickle file and cut out the time to query the database to read the sales tables each time the notebook runs.

In [8]:
# query the database and read the product table
# sales = %sql SELECT * FROM sales
# sales_df = sales.DataFrame()
# sales_df.info()

In [9]:
# load the dataframe into a pickle file
# sales_df.to_pickle('sales_df.pickle')
# del sales_df

In [10]:
# load the dataframe from the saved pickle file
loaded_sales_df = pd.read_pickle('sales_df.pickle')
loaded_sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19454838 entries, 0 to 19454837
Data columns (total 13 columns):
 #   Column                 Dtype
---  ------                 -----
 0   product_id             object
 1   store_id               object
 2   date                   object
 3   sales                  float64
 4   revenue                float64
 5   stock                  float64
 6   price                  float64
 7   promo_type_1           object
 8   promo_bin_1            object
 9   promo_type_2           object
 10  promo_bin_2            object
 11  promo_discount_2       object
 12  promo_discount_type_2  object
dtypes: float64(4), object(9)
memory usage: 1.9+ GB

## 3.2.0 Average Revenue

### 3.2.1 Average revenue for all the stores

In [11]:
avg_revenue = %sql SELECT CAST(AVG(revenue) AS DECIMAL (5,2)) FROM sales
avg_revenue

 * postgresql://postgres:***@localhost/sales
1 rows affected.

[(Decimal('2.06'),)]

### 3.2.2 Average revenue by store

In [12]:
%%sql avg_revenue_by_store << SELECT store_id, CAST(
    AVG(revenue) AS DECIMAL (5,2)
    ) FROM sales GROUP BY store_id

 * postgresql://postgres:***@localhost/sales
144 rows affected.
Returning data to local variable avg_revenue_by_store

In [13]:
avg_revenue_by_store_df = avg_revenue_by_store.DataFrame()
avg_revenue_by_store_df.head()

  store_id   avg
0    S0001  3.18
1    S0002  2.12
2    S0003  1.90
3    S0004  1.37
4    S0005  1.49

Let's find the number of stores with average sales that is greater than the combined average sales for all the stores.

In [14]:
%%sql stores_above_avg_revenue << SELECT *
FROM (SELECT store_id, CAST(
    AVG(revenue) AS DECIMAL (5,2)
    ) FROM sales GROUP BY store_id) AS result
WHERE result.avg > (
    SELECT CAST(
        AVG(revenue) AS DECIMAL (5,2)
        ) FROM sales
    )
    ORDER BY result.avg DESC

 * postgresql://postgres:***@localhost/sales
37 rows affected.
Returning data to local variable stores_above_avg_revenue

In [15]:
stores_above_avg_revenue_df = stores_above_avg_revenue.DataFrame()
stores_above_avg_revenue_df.head()

  store_id   avg
0    S0085  6.63
1    S0095  5.81
2    S0097  5.34
3    S0026  4.95
4    S0062  4.85

### 3.2.3 Average revenue for a specified store

### Specify one store_id

In [16]:
%%sql store_avg_revenue << SELECT * 
FROM(SELECT store_id, CAST(AVG(revenue) AS DECIMAL (5,2)) 
FROM sales GROUP BY store_id) AS result 
WHERE result.store_id = 'S0100'

 * postgresql://postgres:***@localhost/sales
1 rows affected.
Returning data to local variable store_avg_revenue

In [17]:
store_avg_revenue

[('S0100', Decimal('2.65'))]

### Specify two store_ids

In [18]:
select_store_id = ('S0100', 'S0101')

In [19]:
%%sql select_store_avg_revenue << SELECT * 
FROM(SELECT store_id, CAST(AVG(revenue) AS DECIMAL (5,2)) 
FROM sales GROUP BY store_id) AS result 
WHERE result.store_id IN {select_store_id}

 * postgresql://postgres:***@localhost/sales
2 rows affected.
Returning data to local variable select_store_avg_revenue

In [20]:
select_store_avg_revenue

[('S0100', Decimal('2.65')), ('S0101', Decimal('2.41'))]

### Specify a range of store_ids selected from table

In [21]:
%%sql select_range_store_avg_revenue << SELECT * 
FROM(SELECT store_id, CAST(AVG(revenue) AS DECIMAL (5,2)) 
FROM sales GROUP BY store_id) AS result 
WHERE result.store_id BETWEEN 'S0140' AND 'S0144'

 * postgresql://postgres:***@localhost/sales
5 rows affected.
Returning data to local variable select_range_store_avg_revenue

In [22]:
select_range_store_avg_revenue

[('S0140', Decimal('1.29')),
 ('S0141', Decimal('0.73')),
 ('S0142', Decimal('0.98')),
 ('S0143', Decimal('0.86')),
 ('S0144', Decimal('0.92'))]

## 3.3.0 Revenue by city

### Revenue from each store in each city
Here, we want to identify the revenue from a particular store in a particular city

In [23]:
%%sql revenue_by_store_city_id << SELECT store_cities.city_id, sales.revenue
FROM sales 
INNER JOIN store_cities ON sales.store_id=store_cities.store_id

 * postgresql://postgres:***@localhost/sales
19454838 rows affected.
Returning data to local variable revenue_by_store_city_id

In [24]:
revenue_by_store_city_id_df = revenue_by_store_city_id.DataFrame()
revenue_by_store_city_id_df.head()

  city_id  revenue
0    C008     0.00
1    C031     2.50
2    C031     2.55
3    C014     1.16
4    C027     0.93

The revenue_by_store_city_id query returned a huge number of rows. We can group the result of the query by city_id but first let's see how unique city_ids we have in the result

In [25]:
len(revenue_by_store_city_id_df['city_id'].unique())

37

### Revenue from each city

In [26]:
%%sql total_revenue_by_city_id << SELECT city_id, CAST(
    SUM(revenue) AS DECIMAL (10,2)
    ) 
FROM sales 
INNER JOIN 
store_cities ON sales.store_id=store_cities.store_id
GROUP BY city_id

 * postgresql://postgres:***@localhost/sales
37 rows affected.
Returning data to local variable total_revenue_by_city_id

In [27]:
total_revenue_by_city_id_df = total_revenue_by_city_id.DataFrame()
total_revenue_by_city_id_df.head()

  city_id         sum
0    C001   223137.25
1    C002   680987.33
2    C003   103252.45
3    C004  1027630.08
4    C005   417360.83

Which city generated the maximum revenue?

In [28]:
%%sql city_max_revenue << SELECT city_id, CAST(
    SUM(revenue) AS DECIMAL (10,2)
    ) 
FROM sales 
INNER JOIN store_cities ON sales.store_id=store_cities.store_id
GROUP BY city_id
ORDER BY sum DESC
LIMIT 1

 * postgresql://postgres:***@localhost/sales
1 rows affected.
Returning data to local variable city_max_revenue

In [29]:
city_max_revenue

[('C014', Decimal('12760439.56'))]

## 3.3.0 Revenue by store

### Revenue from each store_id in the cities where the store_id exists

In [30]:
%%sql total_revenue_by_store_id << SELECT sales.store_id, city_id, CAST(
    SUM(revenue) AS DECIMAL (10,2)
    ) 
FROM sales 
INNER JOIN 
store_cities ON sales.store_id=store_cities.store_id
GROUP BY sales.store_id, city_id

 * postgresql://postgres:***@localhost/sales
144 rows affected.
Returning data to local variable total_revenue_by_store_id

In [31]:
total_revenue_by_store_id_df = total_revenue_by_store_id.DataFrame()
total_revenue_by_store_id_df.head()

  store_id city_id        sum
0    S0001    C031  847042.16
1    S0002    C007  494121.62
2    S0003    C014  132146.69
3    S0004    C022  174120.06
4    S0005    C001  108092.49

Which store in which city generated the maximum revenue?

In [32]:
%%sql store_max_revenue << SELECT sales.store_id, city_id, CAST(
    SUM(revenue) AS DECIMAL (10,2)
    ) 
FROM sales 
INNER JOIN store_cities ON sales.store_id=store_cities.store_id
GROUP BY sales.store_id, city_id
ORDER BY sum DESC
LIMIT 1

 * postgresql://postgres:***@localhost/sales
1 rows affected.
Returning data to local variable store_max_revenue

How much is the revenue?

In [33]:
store_max_revenue

[('S0085', 'C014', Decimal('2156037.86'))]

## 3.3.0 Revenue by product

### Revenue from each product_id

In [34]:
%%sql total_revenue_by_product_id << SELECT sales.product_id, CAST(
    SUM(revenue) AS DECIMAL (10,2)) 
FROM sales 
INNER JOIN product ON sales.product_id=product.product_id
GROUP BY sales.product_id

 * postgresql://postgres:***@localhost/sales
649 rows affected.
Returning data to local variable total_revenue_by_product_id

In [35]:
total_revenue_by_product_id_df = total_revenue_by_product_id.DataFrame()
total_revenue_by_product_id_df.head()

  product_id       sum
0      P0001  21128.44
1      P0002   9776.39
2      P0004   1631.29
3      P0005  25408.62
4      P0006   2550.17

Which product generated the maximum revenue?

In [36]:
%%sql product_max_revenue << SELECT *
FROM(SELECT sales.product_id, CAST(SUM(revenue) AS DECIMAL (10,2)) 
FROM sales 
INNER JOIN product ON product.product_id=sales.product_id
GROUP BY sales.product_id
ORDER BY sum DESC) AS result
WHERE result.sum IS NOT NULL
LIMIT 1

 * postgresql://postgres:***@localhost/sales
1 rows affected.
Returning data to local variable product_max_revenue

In [37]:
product_max_revenue

[('P0103', Decimal('2670199.66'))]

We can generate a table for the revenue generated for each product

In [38]:
%%sql total_revenue_by_product_by_store << SELECT sales.product_id, sales.store_id, CAST(
    SUM(revenue) AS DECIMAL (10,2)) 
FROM sales 
INNER JOIN product ON sales.product_id=product.product_id
GROUP BY sales.product_id, sales.store_id

 * postgresql://postgres:***@localhost/sales
37676 rows affected.
Returning data to local variable total_revenue_by_product_by_store

In [39]:
total_revenue_by_product_by_store_df = total_revenue_by_product_by_store.DataFrame()
total_revenue_by_product_by_store_df.head()

  product_id store_id      sum
0      P0001    S0001  1616.59
1      P0001    S0002   577.25
2      P0001    S0004    66.79
3      P0001    S0008   129.45
4      P0001    S0010   234.26

Let's find the product that generated the highest revenue looking at the individual stores. We can also identify the store where that product was sold.

In [40]:
%%sql product_by_store_max_revenue << SELECT *
FROM(SELECT sales.product_id, sales.store_id, CAST(SUM(revenue) AS DECIMAL (10,2)) 
FROM sales 
INNER JOIN product ON product.product_id=sales.product_id
GROUP BY sales.product_id, sales.store_id
ORDER BY sum DESC) AS result
WHERE result.sum IS NOT NULL
LIMIT 1

 * postgresql://postgres:***@localhost/sales
1 rows affected.
Returning data to local variable product_by_store_max_revenue

In [41]:
product_by_store_max_revenue

[('P0103', 'S0097', Decimal('278874.15'))]